Documents/ВрачебнаяКомиссия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВрачебнаяКомиссия</Name>
			<BasedOn>
				<xr:Item>Document.ЛистокНетрудоспособности</xr:Item>
				<xr:Item>Document.Прием</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.удалитьЦелиПроведенияВК</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаНетрудоспособности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛистокНетрудоспособности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияНетрудоспособности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассмотренныеВопросы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекомендации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жалобы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лечение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тестовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Диагнозы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Диагноз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньОбоснованности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КлассификацииДиагнозов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНозологическойЕдиницы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КлассификацииДиагнозов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЭлектронныеПодписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЭлектронныеПодписи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Comment>Версия набора ключевых реквизитов для подписания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверкиПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомуВыданСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отпечаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписьВерна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиПодписи</Name>
					<Comment>Заполнено только в том случае, если подпись неверна</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиСертификата</Name>
					<Comment>Заполнено только в том случае, если сертификат недействителен</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстановившийПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанФайлЭМД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Подписанный объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодписанныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РолиИПодписиЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РолиИПодписиЭМД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УИД_ЭЦП</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольПодписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПриПодписиМедДокументов</v8:Type>
						<v8:Type>cfg:EnumRef.РолиПодписей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД_ЭМД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРоли</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РолиПодписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РолиПодписей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПредседательМедКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскаяОрганизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛечащийВрач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаведующийОтделением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредседательВрачебнойКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧленВрачебнойКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвторДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Участник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВрачебнаяКомиссия/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает доступные варианты печати документа
// 
// Возвращаемое значение:
//   - Струткура - структура, каждая строка которой соответствует одному из вариантов печати.
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("Протокол", НСтр("ru='Протокол'"));
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура формирует печатную форму документа
// Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  СсылкаНаОбъект	 - ДокументСсылка.ВрачебнаяКомиссия - Печатаемый документ.
//  ИмяМакета		 - Строка - Имя печатной формы
// 
// Возвращаемое значение:
//   - ТабличныйДокумент.
//
Функция Печать(СсылкаНаОбъект, ИмяМакета) Экспорт
	
	Перем ТабДок;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "Протокол" Тогда
		ТабДок = ПечатьПротоколВКК(СсылкаНаОбъект);
	ИначеЕсли ИмяМакета = "ПротоколВКК_ДляМедкарты" Тогда
		ТабДок = ПечатьПротоколВКК_ДляМедкарты(СсылкаНаОбъект);
	КонецЕсли;
	
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьИменаКлючевыхРеквизитов() Экспорт
	
	// !ДанныеОбъекта - служебное имя реквизита, означающее, что процедура формирования строки значений полей полностью переопределена.
	// !ХешФайлов - служебное имя реквизита, формирует строку хеша файлов по объекту
	МассивИмен = Новый Массив;
	МассивИмен.Добавить("!ДанныеОбъекта");
	Возврат МассивИмен;

КонецФункции

Процедура ДополнитьТекстЗапросаДляПолученияПриемовЭМКПоВрачебнойКомиссии(Форма, ТекстЗапроса) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВК") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаВК =
		"  ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВрачебнаяКомиссия.Ссылка КАК Ссылка,
		|	ВрачебнаяКомиссия.ПредседательКомиссии КАК ПредседательКомиссии,
		|	ВрачебнаяКомиссия.Дата КАК Дата,
		|	ВрачебнаяКомиссия.Представление КАК Представление,
		|	ЛОЖЬ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВрачебнаяКомиссия.Основание) = ТИП(Документ.Прием)
		|			ТОГДА ВрачебнаяКомиссия.Основание.ПервичныйПрием
		|		ИНАЧЕ ВрачебнаяКомиссия.Ссылка
		|	КОНЕЦ КАК ПервичныйПрием
		|ИЗ
		|	Документ.ВрачебнаяКомиссия КАК ВрачебнаяКомиссия
		|ГДЕ
		|	ВрачебнаяКомиссия.Клиент = &Клиент
		|	И ВрачебнаяКомиссия.Проведен";
	
	Если ЗначениеЗаполнено(Форма.МедицинскаяКарта) Тогда
		ТекстЗапросаВК = ТекстЗапросаВК + "
		|	И ВрачебнаяКомиссия.МедицинскаяКарта = &Карта";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.ДатаНачала) Тогда
		ТекстЗапросаВК = ТекстЗапросаВК + " И НачалоПериода(ВрачебнаяКомиссия.Дата,ДЕНЬ) >= &ДатаНач";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.ДатаОкончания) Тогда
		ТекстЗапросаВК = ТекстЗапросаВК + " И НачалоПериода(ВрачебнаяКомиссия.Дата,ДЕНЬ) <= &ДатаКон";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.Врач) Тогда
		ТекстЗапросаВК = ТекстЗапросаВК + " И ВрачебнаяКомиссия.ПредседательКомиссии В ИЕРАРХИИ (&Врач)";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапросаВК;
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаДляРазделовЭМКПоВрачебнойКомиссии(НачалоТекстаЗапроса) Экспорт
	
	ПродолжениеТекстаЗапроса = 
		"ВЫБРАТЬ
		|	РазделыМедицинскихКарт.Порядок,
		|	РазделыМедицинскихКарт.Наименование,
		|	ВрачебнаяКомиссия.HTMLПредставление,
		|	НЕОПРЕДЕЛЕНО,
		|	РазделыМедицинскихКарт.Ссылка,
		|	ЛОЖЬ КАК ПечатаетсяБезПереходаНаНовуюСтраницу,
		|	НЕОПРЕДЕЛЕНО КАК ВидШаблона,
		|	ВрачебнаяКомиссия.Ссылка КАК Прием
		|ИЗ
		|	РазделыМедицинскихКарт КАК РазделыМедицинскихКарт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВрачебнаяКомиссия КАК ВрачебнаяКомиссия
		|		ПО (ВрачебнаяКомиссия.Проведен)
		|			И (ВрачебнаяКомиссия.МедицинскаяКарта = &МедицинскаяКарта)
		|			И (РазделыМедицинскихКарт.ВыводитьПротоколыВрачебныхКомиссий)
		|			И (РазделыМедицинскихКарт.ТипРаздела В (&ВидыРазделовДляВыводаШаблонов))
		|			И (ВрачебнаяКомиссия.Ссылка В (&ВыбранныеДокументы))";
	
	НачалоТекстаЗапроса = СтрШаблон("%1%2%2ОБЪЕДИНИТЬ ВСЕ%2%2%3", НачалоТекстаЗапроса, Символы.ПС, ПродолжениеТекстаЗапроса);
	
КонецПроцедуры

Функция РолиДляПодписания() Экспорт
	
	Роли = Новый Массив;
	Роли.Добавить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(14, "РолиПриПодписиМедДокументов"));
	Роли.Добавить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(16, "РолиПриПодписиМедДокументов"));
	Возврат Роли;
	
КонецФункции

Функция РольДоступнаТекущемуПользователю(СсылкаНаОбъект, Роль) Экспорт
	
	ТекущийСотрудник = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	
	Если Не ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Роль = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(14, "РолиПриПодписиМедДокументов") Тогда
		Возврат ТекущийСотрудник = СсылкаНаОбъект.ПредседательКомиссии;
	ИначеЕсли Роль = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(16, "РолиПриПодписиМедДокументов") Тогда
		Возврат СсылкаНаОбъект.СоставКомиссии.НайтиСтроки(Новый Структура("Сотрудник", ТекущийСотрудник)).Количество() > 0;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СохранитьЭМД(МедицинскийДокумент, ТекстОшибки, СохранитьЭМД) Экспорт
	
	ДанныеВК = Новый Соответствие;
	
	ДанныеВК.Вставить("Документ",						 МедицинскийДокумент.УникальныйИдентификатор());
	ДанныеВК.Вставить("Дата",							 НачалоДня(МедицинскийДокумент.Дата));
	ДанныеВК.Вставить("Клиент",							 МедицинскийДокумент.Клиент);
	ДанныеВК.Вставить("Цель",							 МедицинскийДокумент.Цель);
	ДанныеВК.Вставить("Заключение",						 МедицинскийДокумент.Заключение);
	ДанныеВК.Вставить("ДатаНачалаНетрудоспособности",	 МедицинскийДокумент.ДатаНачалаНетрудоспособности);
	ДанныеВК.Вставить("ДатаОкончанияНетрудоспособности", МедицинскийДокумент.ДатаОкончанияНетрудоспособности);
	ДанныеВК.Вставить("ПредседательКомиссии",			 МедицинскийДокумент.ПредседательКомиссии);
	ДанныеВК.Вставить("HTMLПредставление",				 МедицинскийДокумент.HTMLПредставление);
	ДанныеВК.Вставить("МедицинскаяКарта",				 МедицинскийДокумент.МедицинскаяКарта);
	ДанныеВК.Вставить("РассмотренныеВопросы",			 МедицинскийДокумент.РассмотренныеВопросы);
	ДанныеВК.Вставить("Рекомендации",					 МедицинскийДокумент.Рекомендации);
	ДанныеВК.Вставить("Жалобы",							 МедицинскийДокумент.Жалобы);
	ДанныеВК.Вставить("Лечение",						 МедицинскийДокумент.Лечение);
	
	СоставКомиссии = Новый Массив;
	Для Каждого СтрокаСоставаКомиссии Из МедицинскийДокумент.СоставКомиссии Цикл
		СоставКомиссии.Добавить(СтрокаСоставаКомиссии.Сотрудник);
	КонецЦикла;
	ДанныеВК.Вставить("СоставКомиссии", СоставКомиссии);
	
	Диагнозы = Новый Массив;
	Для Каждого СтрокаДиагноза Из МедицинскийДокумент.Диагнозы Цикл
		СтруктураДиагноза = Новый Структура;
		СтруктураДиагноза.Вставить("Диагноз",					СтрокаДиагноза.Диагноз);
		СтруктураДиагноза.Вставить("СтепеньОбоснованности",		СтрокаДиагноза.СтепеньОбоснованности);
		СтруктураДиагноза.Вставить("ВидНозологическойЕдиницы",	СтрокаДиагноза.ВидНозологическойЕдиницы);
		СтруктураДиагноза.Вставить("Описание",					СтрокаДиагноза.Описание);
		Диагнозы.Добавить(СтруктураДиагноза);
	КонецЦикла;
	ДанныеВК.Вставить("Диагнозы", Диагнозы);
	
	Поток = Новый ПотокВПамяти();
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьПоток(Поток,,, Новый ПараметрыЗаписиJSON(, Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON, ДанныеВК, , "ПреобразованиеJSON", ОбщегоНазначенияПереопределяемый);
	ЗаписьJSON.Закрыть();
	
	ДД = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Если СохранитьЭМД Тогда
		доп_РаботаСФайлами.ДобавитьФайлЭМД(МедицинскийДокумент, ДД, "json");
	КонецЕсли;
	
	Возврат Новый Структура("ДД, Расширение", ДД, "json");;
	
КонецФункции

Функция ПолучитьНеподписанныеДокументыДляОтчётаЭЦП(ПараметрыДанных, ДокументыРЭМД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""Врачебные комиссии"" КАК ТипМедицинскогоДокумента,
		|	ВрачебнаяКомиссия.Ссылка КАК Ссылка,
		|	ВрачебнаяКомиссия.ДатаДокумента КАК ДатаДокумента,
		|	ЛОЖЬ КАК ПодписьРЭМД,
		|	ИСТИНА КАК ПодписьФайловЭМД
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ВрачебнаяКомиссия.Ссылка КАК Ссылка,
		|		ВрачебнаяКомиссия.Дата КАК ДатаДокумента,
		|		ЗНАЧЕНИЕ(Перечисление.РолиПодписей.ПредседательВрачебнойКомиссии) КАК Роль
		|	ИЗ
		|		Документ.ВрачебнаяКомиссия КАК ВрачебнаяКомиссия
		|	ГДЕ
		|		ВрачебнаяКомиссия.ПредседательКомиссии = &СотрудникДокумента
		|		И НЕ ВрачебнаяКомиссия.ПометкаУдаления
		|		И НЕ ВрачебнаяКомиссия.Тестовый
		|		И ВрачебнаяКомиссия.Проведен
		|		И (&КонецПериода = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ИЛИ ВрачебнаяКомиссия.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ВрачебнаяКомиссия.Ссылка,
		|		ВрачебнаяКомиссия.Дата,
		|		ЗНАЧЕНИЕ(Перечисление.РолиПодписей.ЧленВрачебнойКомиссии)
		|	ИЗ
		|		Документ.ВрачебнаяКомиссия КАК ВрачебнаяКомиссия
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВрачебнаяКомиссия.СоставКомиссии КАК СоставВрачебнойКомиссии
		|			ПО (СоставВрачебнойКомиссии.Ссылка = ВрачебнаяКомиссия.Ссылка)
		|				И (СоставВрачебнойКомиссии.Сотрудник = &СотрудникДокумента)
		|				И (НЕ ВрачебнаяКомиссия.ПометкаУдаления)
		|				И (НЕ ВрачебнаяКомиссия.Тестовый)
		|				И (ВрачебнаяКомиссия.Проведен)
		|				И (&КонецПериода = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ИЛИ ВрачебнаяКомиссия.Дата МЕЖДУ &НачалоПериода И &КонецПериода)) КАК ВрачебнаяКомиссия
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РолиИПодписиЭМД КАК РолиИПодписиЭМД
		|			ПО (РолиИПодписиЭМД.УИД_ЭЦП = ЭлектронныеПодписи.УникальныйИдентификатор)
		|		ПО (ЭлектронныеПодписи.Объект = ВрачебнаяКомиссия.Ссылка)
		|			И (НЕ ЭлектронныеПодписи.ПодписанФайлЭМД)
		|			И (РолиИПодписиЭМД.РольПодписи = ВрачебнаяКомиссия.Роль)
		|ГДЕ
		|	ЭлектронныеПодписи.Объект ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыДанных.КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыДанных.НачалоПериода);
	Запрос.УстановитьПараметр("СотрудникДокумента", ПараметрыДанных.СотрудникДокумента);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#Область ЦелиВрачебнойКомиссии

// Возвращает ссылку на элемент "Экспертиза временной нетрудоспособности", определяя его по коду в ЕГИСЗ.
// 
// Возвращаемое значение:
//   - СправочникСсылка.ЦелиПроведенияВК.
Функция ПолучитьЭлементЭкспертизаВременнойНетрудоспособоности() Экспорт
	УидЕГИСЗ = 13;
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(УИДЕГИСЗ, Перечисления.ВидыКлассификаторовМинЗдрава.ЦелиПроведенияВК);
КонецФункции

// Возвращает ссылку на элемент "Иные цели", определяя его по коду в ЕГИСЗ.
// 
// Возвращаемое значение:
//   - СправочникСсылка.ЦелиПроведенияВК.
Функция ПолучитьЭлементИныеЦели() Экспорт
	УидЕГИСЗ = 14;
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(УИДЕГИСЗ, Перечисления.ВидыКлассификаторовМинЗдрава.ЦелиПроведенияВК);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьПротоколВКК(СсылкаНаОбъект)
	
	Перем Выборка;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	
	Макет = ПолучитьМакет("ПротоколВКК");
	
	РеквизитыОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(СсылкаНаОбъект);
	ОбластьМакета.Параметры.Дата = Формат(СсылкаНаОбъект.Дата, "ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.ДанныеОрганизацииНаименование = РеквизитыОрганизации.НазваниеОрганизации;
	ОбластьМакета.Параметры.ДанныеОрганизацииАдрес = РеквизитыОрганизации.Адрес;
	ОбластьМакета.Параметры.ДанныеОрганизацииОГРН = РеквизитыОрганизации.ОГРН;
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ДанныеПациента");
	ОбластьМакета.Параметры.ФИОПациента = СсылкаНаОбъект.Клиент;
	ОбластьМакета.Параметры.ДатаРождения = Формат(СсылкаНаОбъект.Клиент.ДатаРождения, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Повестка");
	ОбластьМакета.Параметры.Цель = НРег(СсылкаНаОбъект.Цель.НаименованиеПолное);
	ТабДок.Вывести(ОбластьМакета);
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект.РассмотренныеВопросы) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("РассмотренныеВопросы");
		ОбластьМакета.Параметры.РассмотренныеВопросы = СсылкаНаОбъект.РассмотренныеВопросы;
		ТабДок.Вывести(ОбластьМакета);
	КонецЕсли; 
	
	// Лист нетрудоспособности
	ОснованиеДокумента = СсылкаНаОбъект.Основание;
	Если ЗначениеЗаполнено(ОснованиеДокумента)
		И ТипЗнч(ОснованиеДокумента) = Тип("ДокументСсылка.ЛистокНетрудоспособности")
	Тогда
		Если ЗначениеЗаполнено(ОснованиеДокумента.Номер) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ЛННомер");
			ОбластьМакета.Параметры.НомерЛисткаНетрудоспособности = ОснованиеДокумента.Номер;
			ТабДок.Вывести(ОбластьМакета);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект.ДатаНачалаНетрудоспособности)
			И ЗначениеЗаполнено(СсылкаНаОбъект.ДатаОкончанияНетрудоспособности)
		Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ЛНПериод");
			ОбластьМакета.Параметры.ДатаНачало		= Формат(СсылкаНаОбъект.ДатаНачалаНетрудоспособности,	 "ДФ=dd.MM.yyyy");
			ОбластьМакета.Параметры.ДатаОкончание	= Формат(СсылкаНаОбъект.ДатаОкончанияНетрудоспособности, "ДФ=dd.MM.yyyy");
			ОбластьМакета.Параметры.ВсегоДней		= 1 + (НачалоДня(СсылкаНаОбъект.ДатаОкончанияНетрудоспособности) - НачалоДня(СсылкаНаОбъект.ДатаНачалаНетрудоспособности)) / 86400;
		КонецЕсли;
		ТабДок.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект.Жалобы) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Жалобы");
		ОбластьМакета.Параметры.Жалобы = СсылкаНаОбъект.Жалобы;
		ТабДок.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект.Лечение) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Лечение");
		ОбластьМакета.Параметры.Лечение = СсылкаНаОбъект.Лечение;
		ТабДок.Вывести(ОбластьМакета);
	КонецЕсли;
	
	ВывестиДиагнозыПротоколаВКК(СсылкаНаОбъект, ТабДок, Макет);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заключение");
	ОбластьМакета.Параметры.Заключение = СсылкаНаОбъект.Заключение;
	ТабДок.Вывести(ОбластьМакета);
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект.Рекомендации) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Рекомендации");
		ОбластьМакета.Параметры.Рекомендации = СсылкаНаОбъект.Рекомендации;
		ТабДок.Вывести(ОбластьМакета);
	КонецЕсли;
	
	// ЭЦП
	ЭЦПСотрудников = Новый Соответствие;
	Если ЭЦП_УМЦ_Сервер.ИспользоватьЭлектронныеПодписиЭМК()
		И СсылкаНаОбъект.ПодписанЭП
	Тогда
		Выборка = доп_СертификатыЭЦП.ПолучитьЭлектронныеПодписи(СсылкаНаОбъект);
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.УстановившийПодпись.Сотрудник) Тогда
				ДанныеСертификата = ЭЦП_УМЦ_Сервер.ПолучитьДанныеСертификата(Выборка.Сертификат, СсылкаНаОбъект, Выборка.ДатаПодписи);
				ЭЦПСотрудников.Вставить(Выборка.УстановившийПодпись.Сотрудник, ДанныеСертификата);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПредседательКомиссии");
	ОбластьМакета.Параметры.ФИОПредседатель = ОбщегоНазначения.ФИОФизЛица(СсылкаНаОбъект.ПредседательКомиссии);
	ДобавитьШтампЭЦП(ЭЦПСотрудников, СсылкаНаОбъект.ПредседательКомиссии, "ЭЦППредседателя", ОбластьМакета, Макет);
	ТабДок.Вывести(ОбластьМакета);
	
	ПервыйСотрудник = Истина;
	Для Каждого СтрокаСотрудника Из СсылкаНаОбъект.СоставКомиссии Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ЧленыКомиссии");
		ОбластьМакета.Параметры.ФИОСотрудник = ОбщегоНазначения.ФИОФизЛица(СтрокаСотрудника.Сотрудник);
		Если ПервыйСотрудник Тогда
			ПервыйСотрудник = Ложь;
		Иначе
			ОбластьЗаголовка = ОбластьМакета.Области.Найти("ЗаголовокЧленКомиссии");
			ОбластьЗаголовка.Текст = "";
		КонецЕсли;
		ДобавитьШтампЭЦП(ЭЦПСотрудников, СтрокаСотрудника.Сотрудник, "ЭЦПЧленаКомиссии", ОбластьМакета, Макет);
		ТабДок.Вывести(ОбластьМакета);
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура ДобавитьШтампЭЦП(ЭЦПСотрудников, Сотрудник, ИмяОбластиПодписи, ОбластьМакета, Макет)
	
	ДанныеПодписи = ЭЦПСотрудников.Получить(Сотрудник);
	Если ДанныеПодписи <> Неопределено Тогда
		ОбластьЭЦП = Макет.ПолучитьОбласть("ЭЦП");
		ЗаполнитьЗначенияСвойств(ОбластьЭЦП.Параметры, ДанныеПодписи);
		ТабДокЭЦП = Новый ТабличныйДокумент;
		ТабДокЭЦП.Вывести(ОбластьЭЦП);
		ОбластьМакета.ВставитьОбласть(ТабДокЭЦП.Области["ЭЦП"], ОбластьМакета.Области[ИмяОбластиПодписи]);
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьПротоколВКК_ДляМедкарты(СсылкаНаОбъект)
	
	Перем Выборка;
	
	ТхтДок = Новый ТекстовыйДокумент;

	Макет = ПолучитьМакет("ПротоколВКК_ДляМедкарты");
	
	КодыЗначений = Новый Соответствие;
	
	Макет.УстановитьТекст(СтрЗаменить(Макет.ПолучитьТекст(),"<","&lt;"));
	Макет.УстановитьТекст(СтрЗаменить(Макет.ПолучитьТекст(),">","&gt;"));
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	
	УниверсальныеМеханизмыСервер.УстановитьПараметрТХТМакета(Область, "Дата", Формат(СсылкаНаОбъект.Дата, "ДФ=dd.MM.yyyy"), КодыЗначений);
	УниверсальныеМеханизмыСервер.УстановитьПараметрТХТМакета(Область, "Цель", НРег(СсылкаНаОбъект.Цель.НаименованиеПолное), КодыЗначений);
	ТхтДок.Вывести(Область); 	
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект.Жалобы) Тогда
		Область = Макет.ПолучитьОбласть("Жалобы");
		УниверсальныеМеханизмыСервер.УстановитьПараметрТХТМакета(Область, "Жалобы", СсылкаНаОбъект.Жалобы, КодыЗначений);
		ТхтДок.Вывести(Область); 	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект.Лечение) Тогда
		Область = Макет.ПолучитьОбласть("Лечение");
		УниверсальныеМеханизмыСервер.УстановитьПараметрТХТМакета(Область, "Лечение", СсылкаНаОбъект.Лечение, КодыЗначений);
		ТхтДок.Вывести(Область); 	
	КонецЕсли; 
	
	ВывестиДиагнозыПротоколаВКК(СсылкаНаОбъект, ТхтДок, Макет, КодыЗначений);
	
	Область = Макет.ПолучитьОбласть("Заключение");
	УниверсальныеМеханизмыСервер.УстановитьПараметрТХТМакета(Область, "Заключение", СсылкаНаОбъект.Заключение, КодыЗначений);
	ТхтДок.Вывести(Область); 
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект.Рекомендации) Тогда
		Область = Макет.ПолучитьОбласть("Рекомендации");
		УниверсальныеМеханизмыСервер.УстановитьПараметрТХТМакета(Область, "Рекомендации", СсылкаНаОбъект.Рекомендации, КодыЗначений);
		ТхтДок.Вывести(Область); 	
	КонецЕсли; 
	
	Область = Макет.ПолучитьОбласть("Подвал");
	УниверсальныеМеханизмыСервер.УстановитьПараметрТХТМакета(Область, "ФИОПредседатель", ОбщегоНазначения.ФИОФизЛица(СсылкаНаОбъект.ПредседательКомиссии), КодыЗначений);
	
	Если СсылкаНаОбъект.СоставКомиссии.Количество() <> 0 Тогда
		ЧленыКомиссии = "";
		Для Каждого СтрокаСотрудника Из СсылкаНаОбъект.СоставКомиссии Цикл
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ЧленыКомиссии, ОбщегоНазначения.ФИОФизЛица(СтрокаСотрудника.Сотрудник));
		КонецЦикла;
	КонецЕсли;
	УниверсальныеМеханизмыСервер.УстановитьПараметрТХТМакета(Область, "ФИОСотрудники", ЧленыКомиссии, КодыЗначений);
	ТхтДок.Вывести(Область);		
	
	Для Сч = 1 По 10 Цикл
		ТхтДок.УстановитьТекст(СтрЗаменить(ТхтДок.ПолучитьТекст(),"  "," "));
	КонецЦикла;
	
	УниверсальныеМеханизмыСервер.РаскодироватьПараметрыТХТМакетаHTML(ТхтДок, КодыЗначений);
	
	ТхтДок.УстановитьТекст(СтрЗаменить(ТхтДок.ПолучитьТекст(),"&lt;","<"));
	ТхтДок.УстановитьТекст(СтрЗаменить(ТхтДок.ПолучитьТекст(),"&gt;",">"));
	
	Возврат ТхтДок;
	
КонецФункции

Процедура ВывестиДиагнозыВидаВПечатнуюФорму(ДеревоДиагнозов, ВидДиагноза, Заголовок, ТабДок, ОбластьЗаголовокДиагноза, ОбластьДиагноз, КодыЗначений = Неопределено)
	
	ВетвьВидаДиагнозов = ДеревоДиагнозов.Строки.Найти(ВидДиагноза, "ВидНозологическойЕдиницы");
	Если ВетвьВидаДиагнозов <> Неопределено Тогда
		Если ТипЗнч(ТабДок) = Тип("ТабличныйДокумент") Тогда
			ОбластьЗаголовокДиагноза.Параметры.ЗаголовокДиагноз = Заголовок;
		Иначе
			УниверсальныеМеханизмыСервер.УстановитьПараметрТХТМакета(ОбластьЗаголовокДиагноза, "ЗаголовокДиагноз", Заголовок, КодыЗначений);
		КонецЕсли;
		ТабДок.Вывести(ОбластьЗаголовокДиагноза);
		
		Для Каждого СтрокаДиагноза Из ВетвьВидаДиагнозов.Строки Цикл
	
			ДиагнозТекст = "[" + Строка(СтрокаДиагноза.Диагноз.КодДиагноза) + "] "  + Строка(СтрокаДиагноза.Диагноз);
			Если ЗначениеЗаполнено(СтрокаДиагноза.Описание) Тогда
				ДиагнозТекст = ДиагнозТекст + ", " + СтрокаДиагноза.Описание;
			КонецЕсли; 
			Если ЗначениеЗаполнено(СтрокаДиагноза.СтепеньОбоснованности) Тогда
				ДиагнозТекст = ДиагнозТекст + " (" + Строка(СтрокаДиагноза.СтепеньОбоснованности) + ")";
			КонецЕсли;
			
			Если ТипЗнч(ТабДок) = Тип("ТабличныйДокумент") Тогда
				ОбластьДиагноз.Параметры.Диагноз = ДиагнозТекст;
			Иначе
				УниверсальныеМеханизмыСервер.УстановитьПараметрТХТМакета(ОбластьДиагноз, "Диагноз", ДиагнозТекст, КодыЗначений);
			КонецЕсли;
			ТабДок.Вывести(ОбластьДиагноз);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиДиагнозыПротоколаВКК(СсылкаНаОбъект, ТабДок, Макет, КодыЗначений = Неопределено)
	
	Если СсылкаНаОбъект.Диагнозы.Количество() <> 0 Тогда
		
		ОбластьЗаголовокДиагноза = Макет.ПолучитьОбласть("ДиагнозЗаголовок");
		ОбластьДиагноз = Макет.ПолучитьОбласть("Диагноз");
		
		ТаблицаДиагнозы = ?(ТипЗнч(СсылкаНаОбъект.Диагнозы) = Тип("ТаблицаЗначений"), СсылкаНаОбъект.Диагнозы.Скопировать(), СсылкаНаОбъект.Диагнозы.Выгрузить());
		
		ДеревоДиагнозов = ОбщегоНазначенияСервер.ТаблицуЗначенийВДеревоЗначений(ТаблицаДиагнозы, "ВидНозологическойЕдиницы");
		пчВидыДиагнозов = Перечисления.КлассификацииДиагнозов;
		
		ВидыНозологическихЕдиниц = Новый Соответствие;
		ВидыНозологическихЕдиниц.Вставить(пчВидыДиагнозов.ОсновноеЗаболевание,			  НСтр("ru='Основное заболевание:'"));
		ВидыНозологическихЕдиниц.Вставить(пчВидыДиагнозов.ОсложнениеОсновногоЗаболевания, НСтр("ru='Осложнения:'"));
		ВидыНозологическихЕдиниц.Вставить(пчВидыДиагнозов.СопутствующееЗаболевание,		  НСтр("ru='Сопутствующие заболевания:'"));
		ВидыНозологическихЕдиниц.Вставить(пчВидыДиагнозов.ВнешняяПричина,				  НСтр("ru='Внешняя причина при травмах (отравлениях):'"));
		Для Каждого КлючЗначение Из ВидыНозологическихЕдиниц Цикл
			ВывестиДиагнозыВидаВПечатнуюФорму(ДеревоДиагнозов, КлючЗначение.Ключ, КлючЗначение.Значение, ТабДок, ОбластьЗаголовокДиагноза, ОбластьДиагноз, КодыЗначений);	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
